//Summarize the total count of all local group additions by group name

//Data connector required for this query - M365 Defender - Device* tables

DeviceEvents
| where TimeGenerated > ago (30d)
| where ActionType == "UserAccountAddedToLocalGroup"
| summarize ['Local Group Addition Count']=count() by ['Local Group Name']=tostring(AdditionalFields.GroupName)
| sort by ['Local Group Addition Count']