//Find user accounts with the 'password not required' flag set in Active Directory

//Data connector required for this query - Microsoft Sentinel UEBA

IdentityInfo
| where TimeGenerated > ago(30d)
| summarize arg_max(TimeGenerated, *) by AccountUPN
| extend UACFlags = tostring(UserAccountControl[0])
| where UACFlags == "PasswordNotRequired"