//Find any new operations generated in the Azure AD audit table in the last week compared to the last 90 days

//Data connector required for this query - Azure Active Directory - Audit Logs

let existingoperations=
    AuditLogs
    | where TimeGenerated > ago(90d) and TimeGenerated < ago(7d)
    | distinct OperationName;
AuditLogs
| where TimeGenerated > ago(7d)
| summarize Count=count() by OperationName, Category
| where OperationName !in (existingoperations)
| sort by Count desc 