//Find the most phished users from the last 365 days
SecurityAlert
| where TimeGenerated > ago (365d)
| where ProviderName == "OATP"
| where AlertName in ("Email messages containing malicious URL removed after delivery", "Email messages containing phish URLs removed after delivery")
| mv-expand todynamic(Entities)
| project Entities
| extend User = tostring(Entities.MailboxPrimaryAddress)
| where isnotempty(User)
| summarize ['Count of Phishing Attempts']=count()by User
| order by ['Count of Phishing Attempts']
