//Visualize your security alerts by MITRE ATT&CK tactic

//Data connector required for this query - Security Alert (free table that other Defender products send alert info to)

SecurityAlert
| where TimeGenerated > ago(30d)
//Exclude Sentinel generated alerts if you want to. This may stop you double counting alerts, i.e generated by Azure AD Identity Protection and then again in Sentinel.
| where ProviderName != "ASI Scheduled Alerts"
//
| where isnotempty(Tactics) and Tactics != "Unknown"
| summarize arg_max(TimeGenerated, *) by VendorOriginalId
| summarize Count=count()by Tactics
| sort by Count desc
| render barchart with (title="Security alerts by MITRE ATT&CK tactic")